<m>
<BOA>
<EOA>
*
6539
522
1543
9
632
490
26
668
3125
9558
4039
4237
467
443
1761
4090
5116
9516
5045
112
175
280
198
4573
227
6122
3965
1697
4896
871
1296
2185
826
493
53
3345
257
8310
2315
1237
1578
1177
4314
3356
973
2801
5351
553
1402
2345
3450
1442
4963
2321
5773
6154
402
2215
5422
5169
2679
475
7673
1608
8445
4088
12
6486
10
1327
1470
2136
6161
426
581
4879
2846
5200
3759
8492
2895
6179
3529
3001
2732
218
1249
9929
3384
768
295
2342
3478
3061
5637
8133
2178
1977
5147
259
212
9118
4143
8964
3320
7452
68
7716
47
1359
54
3116
5759
40
3130
4814
1092
442
9637
1115
7353
915
2499
370
559
1164
58
4834
1719
561
1266
7288
242
2103
70
94
3773
7596
1099
3172
2712
4116
5821
1492
2366
618
1874
585
1839
2162
1919
1992
404
2596
4114
946
5063
344
4914
977
309
3099
1096
3244
4593
1213
4878
537
642
920
4736
100
2025
6298
6018
3668
2437
83
2871
895
3043
1186
2694
2149
804
2697
424
4247
1555
1191
3309
7846
8137
825
5159
8768
2749
345
1738
2266
2994
674
2791
3556
8790
305
8686
1103
1343
1801
7680
2520
5826
8866
988
406
3106
7874
545
8375
121
1750
4550
7504
486
1219
816
3312
1850
333
2923
51
1142
17
5244
151
5953
603
511
7224
1453
6739
4014
1153
4443
7181
4243
307
9927
7196
256
1285
730
3861
2725
2010
323
231
228
3087
9187
52
5
5551
542
739
6612
2860
6335
2011
5406
2440
2044
9354
415
122
5074
891
1148
4252
56
278
114
881
4401
1143
342
408
2092
7118
25
609
6817
4929
1571
5085
6095
1860
2167
4308
6523
6495
5225
435
2935
1140
1885
8794
802
766
4563
10174
1912
6528
594
5271
7832
1558
549
684
465
128
3319
568
1129
2639
324
502
7300
1004
2562
10315
5768
1248
1887
23
5326
2286
735
687
8634
2597
2378
902
4520
1364
5057
419
717
2
107
3292
7903
5933
4944
82
1504
5918
1685
4277
5548
4003
620
673
1138
4533
394
2009
1280
10289
1157
637
2201
2305
127
269
2399
6282
6044
1198
7094
1485
7904
531
3592
719
1172
133
5208
6267
1606
928
6698
1218
279
204
4037
1749
10042
6593
1632
2956
4
99
263
327
1350
288
1584
4586
7784
811
3154
3432
6703
4490
226
2521
3057
834
7036
2560
153
5814
1940
1663
3766
4058
4038
3065
1316
3071
738
203
6536
434
1763
9154
833
4264
5489
2988
2967
6452
4310
3757
1429
3253
8114
5037
2137
2301
5121
2333
1585
2491
2192
1827
1267
3155
5376
9664
3466
798
217
579
5840
1204
893
4364
5874
5797
5363
8712
2455
7807
116
3023
4690
2405
5544
1465
7218
8061
7126
2161
2659
1245
1458
10220
3791
5788
5293
4645
5700
156
3084
4177
4618
352
3455
6442
6618
2395
795
547
4323
10172
3076
3838
1225
7520
6816
214
4100
1987
2542
1597
8019
6110
6290
1867
6882
1968
3540
285
3176
3518
6753
8713
3145
499
3799
635
9611
1586
3680
8565
2529
863
66
4190
8214
6033
4634
1652
8374
5590
2480
379
3497
3525
5476
645
6566
2158
7203
3717
113
5460
8028
513
583
4095
50
232
2190
700
3053
5531
1926
2492
6643
975
7491
290
241
3581
3562
6617
9001
206
9263
4225
9454
574
5646
4956
73
1710
4983
8363
1961
582
349
3349
1002
4546
4960
199
4159
7614
7308
5558
7987
487
6787
3652
429
3565
1895
148
1660
3383
6369
3614
5819
792
4121
3100
877
2030
10614
3770
6902
2684
963
88
2660
612
813
1547
2235
265
3107
1211
2909
6025
847
2929
9640
401
1433
1389
3414
29
143
5396
7512
6099
633
6354
2508
934
1807
498
252
1724
416
35
4013
3885
2153
950
641
1214
966
3451
533
10210
2626
1381
2718
4333
1044
0
1167
779
6766
3153
109
200
840
3618
134
5905
4029
866
2447
2135
4285
1500
9013
407
7566
6448
8220
7060
328
4722
9308
1400
8715
210
2918
4635
1273
249
4166
3210
5292
8579
536
4015
6231
786
1342
2693
2807
6788
296
8274
2042
2643
5518
8
8194
3236
8860
3134
3512
1101
180
972
7223
3346
1411
1294
3910
8335
371
997
6749
2910
4865
2567
496
3439
1077
1601
4444
3808
704
2116
321
3033
666
2382
2625
1664
3465
5818
286
3699
4886
2001
439
4416
76
1681
1669
4888
1651
6363
3350
6072
6889
329
3358
1771
852
5889
9159
742
6
4757
1015
2817
2089
1590
784
1739
1607
808
627
619
2168
8321
2707
7978
1477
1546
4943
6358
3653
5068
4457
3051
1932
925
4085
4681
301
996
4686
695
132
2292
8981
5414
896
701
2408
1820
1341
5536
8026
3328
8695
8783
3282
781
4985
8103
2358
3745
97
2780
2024
8170
1746
2976
343
5732
6815
1170
14
3410
1369
2751
6081
4337
726
4094
6229
715
1354
10010
629
1595
7111
2171
3331
8038
6635
589
10357
2367
108
3374
7219
5429
4688
6936
418
2155
4292
2580
2876
1979
4080
1397
4454
5439
360
4373
4833
2064
6716
4970
5050
1983
3249
1346
3502
2306
1629
4144
649
373
7728
1100
823
6316
6854
1181
356
4389
1559
2377
1384
5089
2302
7692
6771
841
4030
1978
3385
7339
5975
3063
10209
6028
4189
6740
1523
5795
4940
593
4555
4750
6275
2738
3150
718
1048
4019
780
5305
990
8747
5216
4947
1334
6387
229
248
991
234
1074
2514
380
7957
2662
1340
2474
1864
6301
5816
7568
8085
33
724
365
1227
1438
5146
294
5346
2389
8046
822
3079
4689
2750
1762
2463
837
7766
1116
1490
974
2253
9739
4348
4531
4719
6555
2312
149
170
543
3584
981
789
1847
3344
144
1780
658
2175
3508
3101
5265
3269
4637
8146
447
7714
1644
4344
3637
5362
1351
992
3714
4614
1743
5283
2427
7381
3069
216
4414
1412
18
4475
976
5076
240
4035
1519
931
8402
1894
7109
2239
2227
3208
2293
2444
4646
2105
617
369
2125
4235
4259
310
558
118
899
10243
3822
5347
1292
3995
4539
306
194
8551
2746
675
2710
2523
1124
8799
6424
455
873
4407
4244
5893
7310
5703
2118
1175
1805
3444
5566
4253
4133
3554
7398
3027
399
3919
1007
6857
1502
2698
4733
7330
2759
3397
6406
2847
6970
2745
4517
2230
4912
462
3636
1117
90
2075
30
3050
4518
6116
9810
10582
7366
1401
3619
6567
6728
8300
8738
1640
4526
6481
201
4334
3205
2690
2706
694
2752
3705
1460
828
495
10249
4545
2605
539
1515
2319
347
72
3117
728
4523
5061
5438
2424
4808
661
5855
967
8978
4560
5470
6208
8120
4883
6973
2559
1279
6660
4316
2781
2633
5335
6353
8084
842
5983
3893
2231
7811
7570
1301
1642
2053
2006
6180
4957
1821
2577
8186
523
714
450
1031
10556
9683
9804
7475
5269
3957
2150
8539
8132
7044
4011
1104
1913
2644
4724
7655
4991
253
6515
3259
2441
303
1403
844
261
2402
3261
1498
4305
2992
4433
5549
1126
167
4432
2067
3827
5021
1111
4737
3481
3173
4741
8661
6034
3859
4851
1321
9097
8336
7069
5413
4300
10296
7521
6925
8753
244
62
38
4101
5093
395
4059
2163
2295
10373
10235
91
4578
782
9680
3736
1196
6998
1428
7733
3826
7653
6521
624
181
4350
517
5119
6996
854
5046
2206
2875
1989
628
937
4939
4123
2754
9517
1221
1006
1937
5789
3122
9678
6311
2269
291
5124
1222
3097
2618
2483
2108
6690
657
463
1339
5136
183
2243
1653
3418
2076
4294
4599
5356
2525
7227
1199
1474
4375
61
2396
4472
4483
1421
15
7392
903
1361
5757
7785
1127
2133
425
10171
797
8479
922
2294
2885
4785
7416
2822
8427
274
8176
5711
6278
5965
1468
5875
4153
313
5038
1674
2101
4856
2650
550
1352
7251
9802
508
1616
829
5741
4356
10526
1726
1923
1150
67
3012
3829
858
5327
7537
2374
1905
3537
1871
3570
2893
7097
2728
8195
5915
3872
161
276
3021
3440
6371
8653
3700
6952
3706
1047
6838
2535
5562
621
3007
422
5857
3421
176
87
320
740
6392
39
3815
1317
1114
2549
562
4990
2283
135
5932
1372
2100
605
2708
3676
6755
7242
5815
8870
6342
10228
7064
125
2086
5661
1159
2819
2003
2631
1043
765
5638
5718
5231
2736
9009
1777
9102
8041
4966
2834
2082
1435
984
384
8242
6194
3697
5492
5640
653
5235
84
1493
5625
2946
2316
6146
4390
3177
1332
3064
6409
55
3274
4589
1444
1611
3647
6248
3802
3401
5817
2727
3568
6162
7007
484
10176
4317
2849
4926
747
8184
2883
1934
8239
4207
7816
2361
5619
2472
2603
215
5354
538
7164
7017
1087
6852
4762
2500
6343
1705
4743
3315
1899
6719
5511
5589
1683
1407
787
4702
9922
4815
7187
929
7930
945
6334
5804
392
7254
548
5491
4631
1552
9138
7306
4278
1323
3002
6808
3127
3252
3507
420
3435
1706
552
569
9928
5143
1917
3422
396
527
5181
3733
5791
3109
5233
3691
1639
5073
1759
27
7729
8874
5336
1261
362
3072
3060
6661
1731
1447
7654
7357
7206
2126
4840
2809
2657
5365
1942
2023
1825
4106
5403
2668
8240
2704
1420
2212
2109
1542
3709
9434
9412
6804
4932
1427
10041
682
1449
7355
6142
3044
3113
7555
3810
5238
1000
777
5500
353
587
6416
1025
457
941
2898
2861
8714
4482
10076
6720
7686
3131
3068
7192
8128
3393
3567
7617
6545
8387
4652
6494
1307
5844
192
644
1370
92
4537
1836
4748
9223
1659
1238
604
8059
744
1009
2281
6341
412
1240
5199
3761
8664
4707
5507
9449
5807
2019
6600
956
7575
1844
1596
1230
930
4848
6422
709
11
1136
6712
9203
4938
953
10392
6955
6473
1233
5178
979
5721
5272
6662
1479
169
9139
7934
4319
1023
1921
924
7311
2249
9568
4804
4183
8601
4395
4406
3498
8245
8138
236
1767
10365
1689
9566
4910
856
4004
1737
8708
4955
10084
298
7142
10301
6558
376
8566
2033
7598
5841
5971
5570
654
4055
6491
4178
2247
4212
5565
2326
2972
1200
5923
