<m>
<BOA>
<EOA>
*
26
198
668
9558
1225
1805
52
804
175
9
1219
490
1237
2474
5817
3125
9009
1273
4039
2374
7537
795
4237
871
6539
522
1543
632
309
25
406
3106
151
4914
6373
6224
329
8259
594
5271
7832
2188
351
1706
578
3699
439
4573
8310
2075
5365
2779
4300
307
4314
467
443
1761
4090
5116
9516
5045
112
280
227
6122
3965
1697
4896
4816
1296
5380
2185
826
493
53
3345
257
933
1801
370
6099
642
3172
404
1381
58
295
3356
4088
1977
5351
553
1402
2345
2391
3450
54
2016
2846
2321
7654
973
269
1442
2801
5121
5773
6154
402
2215
5422
5169
2679
475
7673
1608
8445
12
6486
10
1327
1470
2136
6161
426
581
4879
6493
2358
637
5200
3759
8492
2895
6179
3529
3001
2732
218
1249
9929
3384
768
2342
3478
3061
5637
8133
2178
5147
259
212
9118
2280
7332
3410
4143
8964
3320
7452
3302
1726
525
2305
3116
5759
568
549
4252
68
7716
47
1359
7276
624
40
3130
4814
1092
442
9637
1115
7353
915
2499
559
1177
1164
4834
1719
561
1266
7288
242
2103
70
94
3773
7596
1099
9623
2712
4116
5821
1492
2366
618
1874
585
1839
2162
1578
1919
1992
2596
4114
946
5063
344
977
3099
1096
3244
4593
1213
4878
537
395
783
72
80
228
6739
17
920
4736
100
2025
6298
6018
3668
2437
83
2871
895
3043
1186
2694
2149
2697
424
4247
1555
1191
3309
7846
8137
825
5159
8768
2749
345
1738
2266
2994
674
2791
3556
8790
305
8686
1103
1343
7680
2520
5826
8866
988
7542
7874
545
278
114
881
8375
924
8348
704
3808
121
1750
4550
7504
486
816
3312
1850
333
2923
51
1142
5244
5953
1616
4808
1683
8386
3044
253
603
511
7224
1453
4014
1153
4443
7181
4243
9927
7196
256
1285
8983
645
134
5814
1181
3122
1491
730
3861
2725
7066
2010
323
231
3087
8128
2440
717
9187
5
286
10465
5551
542
739
385
3886
2302
4707
6612
2860
6335
2011
5406
2044
9354
415
122
5074
891
1148
56
8709
4401
1143
342
408
2092
7118
3350
609
6817
4929
1571
2161
582
5085
6095
1860
2167
4308
6523
6495
5225
435
2935
1140
1885
8794
802
766
4563
353
10174
1912
6528
6454
1558
294
10315
684
465
128
3319
7080
210
3695
1724
3071
1586
6643
5709
1129
2639
7300
1619
1004
324
2562
5768
5104
903
9794
866
9890
2153
3512
6955
6889
3197
942
997
633
6354
23
1248
1887
3891
5797
3733
3308
3053
4094
1397
2500
787
5305
673
6396
3085
5326
2286
735
687
8634
1340
516
2597
2378
902
4520
719
125
6852
265
3065
7440
4003
437
3227
756
3368
8909
1297
2337
1267
1364
5057
419
7218
6085
1547
498
2589
9266
4885
7903
2918
2
107
3292
5933
4944
82
1504
2204
5918
1685
1350
4277
5548
458
6162
7007
484
2492
10176
3084
9073
4762
9664
2163
6719
6025
3565
4082
5093
4444
5640
181
3062
1427
4333
620
1138
4533
394
2009
1280
10289
1157
1827
2201
127
2399
6282
6044
1198
7094
1485
7904
531
3592
1172
133
5208
6267
1606
928
6698
1218
279
204
4037
1749
10042
6593
1632
5955
2529
3176
2956
4
99
263
327
288
1584
4586
7784
811
3154
3432
6703
4490
226
2521
3057
2572
834
7036
2560
153
1940
1663
116
5590
2455
3766
4058
4038
966
4457
1316
738
203
6536
434
1763
9154
833
4264
5489
2988
2967
6452
4310
3757
1429
3253
8114
5037
2137
2301
2333
1585
2491
2192
3155
5376
3466
798
217
579
5840
1204
893
4364
5874
4248
5363
8712
7807
3023
4690
2405
5544
1465
8061
7126
2659
1245
1458
10220
1521
3791
5788
5293
4645
5700
156
4177
4618
352
3455
6442
6618
2395
547
4323
10172
3076
3838
3189
7520
6816
214
4100
1987
2542
1597
8019
6110
6290
1867
6882
1968
3540
285
3518
6753
8713
3145
499
3799
635
9611
3680
8565
863
66
4190
8214
6033
4634
1652
1788
3349
4489
343
5476
8374
2480
379
3497
1924
3525
6566
2158
7203
3717
113
5460
8028
513
583
4095
50
232
2190
700
5531
1926
975
7491
290
241
3581
3562
1002
6617
9001
206
9263
4225
9454
574
5646
4956
73
1710
4983
8363
1961
349
4546
3818
4960
199
4159
7614
7308
5558
7987
487
6787
3652
8539
3865
429
21
396
148
5089
2221
5625
1777
3770
6369
10366
3614
5819
1559
1895
1660
792
4121
3100
877
2030
10614
6902
2684
963
88
2660
990
819
55
6458
10358
628
663
4351
5138
7310
3107
4390
18
2316
2235
29
612
813
1211
2909
3293
450
847
2929
9640
401
1433
1389
3414
143
5396
7512
2508
934
1807
502
252
416
35
4013
3885
950
641
4614
2081
1214
3451
533
10210
2626
2718
5905
5738
786
3618
666
2807
728
7341
4150
1902
536
6766
4029
3177
3153
109
200
840
7306
2042
2447
2135
4285
1500
9013
407
7566
6448
8220
7060
8186
4406
328
4722
6450
9238
3374
9308
1400
3041
8715
4635
249
4166
3210
5292
8579
1899
4015
6231
1342
5586
2693
4915
4019
347
6788
296
2643
5518
8
8194
3236
1709
7140
8860
3134
0
1101
180
4963
972
7223
3346
1411
1294
3910
8335
371
6749
1044
2910
4865
2567
496
3439
1077
1601
9534
3443
1167
976
5511
5589
1821
84
334
5734
1085
781
896
10510
2116
321
3033
2382
2625
1664
3465
5818
4886
2001
4416
76
1681
1669
4888
6925
1651
6363
6072
613
9108
3555
7883
4292
3358
1771
852
5889
9159
5507
784
2976
1590
1739
1546
742
6
4757
1015
2817
2089
274
5268
4395
1607
808
627
619
2168
8321
2707
7978
1477
4943
6358
3653
5068
1792
5429
1287
3051
1932
925
4085
4681
301
996
4686
5250
695
132
2292
8981
5414
701
3328
660
8783
1184
8026
8695
3282
4985
8103
3745
2483
1636
97
2780
2024
8170
1746
5732
6815
1170
14
3839
8038
9102
3580
10357
3331
2367
108
1279
1587
177
9100
1341
38
3050
10010
629
1595
7111
2171
7219
4688
6936
418
3383
2155
2580
2876
1979
4080
1335
4454
5439
360
4373
4833
2064
6716
4970
5050
1983
3249
1548
7305
1346
3502
2306
1629
4144
649
373
7728
1100
823
6316
6854
356
3780
4389
2377
1384
7692
6771
841
4030
1978
3385
7339
5975
3063
10209
6028
4189
4702
6481
6740
1523
5795
6712
4940
4627
2727
593
4555
3508
2315
248
320
5774
7229
1893
1661
6470
234
718
3418
1048
4750
6275
2738
3150
780
1354
8747
5216
4947
1334
6387
7575
90
548
240
4399
229
991
1074
2514
380
7957
2662
1864
6301
5816
7568
8085
1835
789
15
4466
3914
724
5146
5517
5346
11
7766
2389
2834
3815
1175
2125
715
1438
306
33
837
8145
365
779
1227
8046
822
3079
2813
4689
2750
1762
2463
1116
1490
974
2253
9739
4348
4531
4719
6555
2312
149
170
543
3584
981
1847
3344
144
1780
39
8148
1990
658
2175
3101
5265
3269
4637
8146
447
268
7714
1644
4344
879
3637
5362
1351
7492
992
3714
1743
5283
2427
7381
3069
216
4414
6000
7585
1412
4475
7686
118
5076
4035
1519
931
8402
6090
4492
2700
6601
2325
277
4515
4370
1894
4817
7109
2239
2227
3208
2293
2444
4646
2105
617
369
4235
4259
8225
4524
1702
310
558
2362
7048
46
2061
194
5495
187
899
10243
3822
1851
1627
7897
4927
6319
5347
1292
3995
4539
8551
2746
675
2710
2523
1124
8799
6424
455
4336
6176
169
5638
873
4407
4244
164
5893
6343
150
5703
3654
8266
62
1596
6820
2118
3444
5566
4253
4133
3554
7398
3027
399
3919
8415
1007
6857
1502
2698
4733
7330
2616
471
2708
605
1001
462
8718
4912
3636
2577
1117
2759
3397
6406
2847
6970
405
2745
4517
2230
6635
3548
4848
4920
2050
30
4518
6116
9810
3550
10224
778
403
1704
2396
1194
1401
3619
6567
3423
7934
4775
5010
7366
10582
6728
8300
8738
1640
4526
2408
201
4334
3205
9097
2706
2752
9923
694
3705
1460
828
495
10249
4545
2605
539
1515
2319
2690
3117
7329
1538
2881
6103
5061
5438
2424
661
5855
967
8978
4560
5470
6208
8120
2053
2980
2079
1435
2559
6660
4883
6973
4316
2781
2633
5335
6353
8084
842
5983
3893
2231
7811
7570
1301
1642
2006
5319
9681
10514
527
2728
2556
3684
8176
6180
4957
523
714
3037
508
3802
3225
10556
4589
9683
5269
8132
7044
4011
1104
5691
1913
2644
4724
7655
4991
589
6515
1611
60
2130
3697
3035
4059
303
7070
1403
3259
2441
384
2922
261
1498
8525
844
2067
4368
2402
3261
4305
2992
10560
4433
5549
1126
167
4432
726
3827
5021
1111
3848
4741
4737
3481
3173
3274
391
291
8661
6034
7653
6663
3859
4851
1321
6507
6915
8240
8336
7069
5413
10296
7521
8753
244
9622
4804
6544
3925
4101
9449
2295
10373
10235
91
4578
782
9680
3736
1361
858
10228
5181
1196
6998
1428
4843
7733
3826
6521
3579
4659
5791
4482
4350
517
5119
6996
854
5827
5971
5046
2206
3109
4342
4198
3403
2824
6461
3890
2179
7334
1989
1407
2875
4497
5403
1087
937
4939
4123
1971
8289
6807
3532
6509
6690
5575
2754
9517
1221
9225
1650
2628
1937
5789
9678
6311
2269
5235
5124
1222
3097
2618
2108
5500
2978
5661
5327
8611
1820
5815
8270
7035
2003
2631
3676
1493
6755
3012
7242
463
1339
2243
1653
657
569
5136
183
2076
4294
4599
7785
161
5356
2525
7227
1199
1474
4375
61
4472
4483
1421
27
8195
2753
4554
5231
5923
8624
5965
5757
9189
3060
6775
999
655
6838
7392
3498
7311
2233
10171
8523
815
1127
2133
425
797
8479
922
4511
1079
1404
2294
2885
4785
6496
1119
6818
7416
2822
8427
7763
400
2150
7165
3257
954
5936
6039
5598
6934
1228
6685
654
2621
1468
5340
5711
6278
5875
4153
313
3072
2247
745
1674
1016
5038
1311
6952
4356
2101
4856
2650
550
1352
7251
9802
829
5741
10526
1047
5409
740
1268
5957
6805
4117
8228
67
5915
1923
1150
3913
1317
2347
1542
3829
1905
3537
1871
3570
2893
7097
6994
3872
276
3021
3440
6371
8653
3700
9538
7729
6248
3706
2535
5562
621
3007
422
5857
3421
1447
2530
176
87
10559
6392
6492
562
10231
1114
2549
4990
6497
8664
2283
135
5932
1372
2100
7064
3315
7866
6699
8870
6342
1501
1754
1041
489
2086
1159
2819
7958
1043
765
5718
2736
9884
4207
195
3338
2946
2384
3458
1462
8041
4966
3064
4601
2082
5242
7759
984
7475
8242
6194
5492
3647
653
8793
2668
7553
1737
2104
6146
1066
1332
6409
270
3645
1861
2356
5453
63
1420
9935
1684
5841
5157
698
4523
3957
1031
1444
6456
4571
1021
1942
538
692
10445
1811
1260
6546
3879
9359
9804
7851
6137
8594
3401
6081
3568
800
3192
364
446
4317
2849
4926
747
8184
2883
1934
8239
7816
2361
5619
2472
2603
215
6772
3068
7164
7017
1210
3994
4794
2423
1025
1449
941
2898
2861
5636
3971
10364
4450
5536
3687
1369
2751
4337
6229
9922
8116
9928
3105
4175
298
799
8045
3281
7402
4815
7187
929
5199
8927
392
7930
1006
945
6334
5804
7254
166
1461
757
5491
4631
1552
9138
4278
1323
552
8769
7615
236
1767
5143
1917
3422
5807
7142
10301
2456
6558
376
3709
8566
4743
5361
6325
7493
1639
5073
1759
8874
5336
1261
362
3411
4421
2143
1000
4212
5565
6661
2212
3369
685
4502
6419
1731
8567
876
3490
6205
7357
7206
2126
4840
3679
5243
2809
2657
2023
1825
4106
4946
3263
7121
5201
4276
2704
7347
1589
6356
8755
2109
9434
9412
6804
4932
10041
682
7355
6142
5354
3113
1370
1705
5084
7555
3810
5238
777
10017
587
6416
457
8714
2830
10076
6720
5144
1418
2877
3131
5167
6605
3029
8839
7192
3393
3567
7617
6545
8387
4652
6494
544
2245
410
4934
644
192
6401
92
1733
592
1494
1307
5844
4537
1836
4748
9223
1659
1238
604
8059
744
1009
2281
6341
412
1240
9453
3761
2019
6600
956
1844
2174
1230
930
6422
709
1136
9203
4938
953
10392
8418
6473
1233
5178
979
5721
5272
3783
6662
1479
8622
6159
5168
9139
5195
9146
4386
3002
6808
3127
3252
9212
3507
420
3435
4319
1023
1921
2249
9568
4183
8601
1753
905
4311
6485
6606
8245
8138
10365
1689
9566
4910
856
4004
453
2952
8708
4955
849
1517
7926
10084
8872
3947
6164
2033
7598
5212
9191
5233
3691
5570
2970
985
4798
4178
3871
4055
6491
5803
9754
9066
7082
3182
6449
7959
4152
3991
3685
1374
2326
5464
1263
155
2007
2972
1200
